uhnp/src/InformationRegisters/МатрицаРекомендуемыхУсловий/МатрицаРекомендуемыхУсловий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МатрицаРекомендуемыхУсловий</name>
  <resources>
    <name>ДопустимыйУровеньЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокОтсрочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПросроченнойЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РольКонтрагента</name>
    <type>
      <types>EnumRef.РолиКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтепеньРиска</name>
    <type>
      <types>CatalogRef.СтепениРиска</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтепеньДоходности</name>
    <type>
      <types>CatalogRef.СтепениДоходности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РолиКонтрагентов/РолиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиКонтрагентов</name>
  <enumValues>
    <name>Покупатели</name>
  </enumValues>
  <enumValues>
    <name>Поставщики</name>
  </enumValues>
  <enumValues>
    <name>Банки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/МатрицаРекомендуемыхУсловий/Forms/ФормаРедактированияМатрицыРекомендуемыхУсловий/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РольКонтрагента = Перечисления.РолиКонтрагентов.Покупатели;
	
	ДобавитьКолонки();
	
	ЗаполнитьМатрицу();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СокрЛП(ИмяСобытия) = "ОбновитьМатрицуРекомендуемыхУсловий" Тогда		
		//Вызывается из формы записи регистра "Матрица рекомендуемых условий" при её закрытии
		ЗаполнитьМатрицу();
	Иначе
		// Неизвестное событие. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РольКонтрагентаПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьМатрицу();	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатрицаРекомендуемыхУсловий

&НаКлиенте
Процедура Подключаемый_ПриИзмененииЯчейкиМатрицы(Элемент)
	
	Идентификатор = Прав(Элемент.Имя,32);
	УстановитьЗначенияВМатрице(Идентификатор, Элементы.МатрицаРекомендуемыхУсловий.ТекущаяСтрока);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСКД(Команда)
	ЗаполнитьМатрицу();	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУсловияОплатыДоговоров(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.УсловияОплатыДоговоров.ФормаОбъекта", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРейтингиКонтрагентов(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.КлассыКонтрагентов.ФормаОбъекта", СтруктураПараметров);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьКолонки()
	
	ВыборкаСтепениДоходности = Справочники.СтепениДоходности.Выбрать(,,,"РеквизитДопУпорядочивания");
	
	ДанныеКДобавлению = Новый ТаблицаЗначений;
	ДанныеКДобавлению.Колонки.Добавить("Группа");
	ДанныеКДобавлению.Колонки.Добавить("Реквизит");
	
	СтепениДоходности = Новый Соответствие;
	
	Пока ВыборкаСтепениДоходности.Следующий() Цикл
		
		Идентификатор = СтрЗаменить(ВыборкаСтепениДоходности.Ссылка.УникальныйИдентификатор(), "-", "");
		СтепениДоходности.Вставить(Идентификатор, ВыборкаСтепениДоходности.Ссылка);
		
		// Добавляем группу элементов.
		НоваяГруппаЭлементов = Элементы.Добавить("Группа" + Идентификатор, Тип("ГруппаФормы"), Элементы.МатрицаРекомендуемыхУсловийГруппаСтепениДоходности);
		НоваяГруппаЭлементов.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппаЭлементов.Заголовок = ВыборкаСтепениДоходности;
		НоваяГруппаЭлементов.Группировка = ГруппировкаКолонок.Вертикальная;
		НоваяГруппаЭлементов.ОтображатьВШапке = Истина;
		
		// Сгенерируем реквизиты для последующего добавления.
		НовыеДанные = ДанныеКДобавлению.Добавить();
		НовыеДанные.Группа = НоваяГруппаЭлементов;
		НовыеДанные.Реквизит = Новый РеквизитФормы("ПроцентАванса"+Идентификатор, ОбщегоНазначения.ОписаниеТипаЧисло(3,0,ДопустимыйЗнак.Неотрицательный), "МатрицаРекомендуемыхУсловий", ВыборкаСтепениДоходности, Истина); 
		
		НовыеДанные = ДанныеКДобавлению.Добавить();
		НовыеДанные.Группа = НоваяГруппаЭлементов;
		НовыеДанные.Реквизит = Новый РеквизитФормы("СрокОтсрочки"+Идентификатор, ОбщегоНазначения.ОписаниеТипаЧисло(3,0,ДопустимыйЗнак.Неотрицательный), "МатрицаРекомендуемыхУсловий", ВыборкаСтепениДоходности, Истина); 
		
			// Сгенерируем реквизиты для последующего добавления.
		НовыеДанные = ДанныеКДобавлению.Добавить();
		НовыеДанные.Группа = НоваяГруппаЭлементов;
		НовыеДанные.Реквизит = Новый РеквизитФормы("ПроцентЗадолженности"+Идентификатор, ОбщегоНазначения.ОписаниеТипаЧисло(3,0,ДопустимыйЗнак.Неотрицательный), "МатрицаРекомендуемыхУсловий", ВыборкаСтепениДоходности, Истина); 
		

		// Сгенерируем реквизиты для последующего добавления.
		НовыеДанные = ДанныеКДобавлению.Добавить();
		НовыеДанные.Группа = НоваяГруппаЭлементов;
		НовыеДанные.Реквизит = Новый РеквизитФормы("ДопустимыйУровеньЗадолженности"+Идентификатор, ОбщегоНазначения.ОписаниеТипаЧисло(15,2,ДопустимыйЗнак.Неотрицательный), "МатрицаРекомендуемыхУсловий", ВыборкаСтепениДоходности, Истина); 
		
	КонецЦикла;
	
	КэшСтепениДоходности = Новый ФиксированноеСоответствие(СтепениДоходности);
	
	ЭтотОбъект.ИзменитьРеквизиты(ДанныеКДобавлению.ВыгрузитьКолонку("Реквизит"));
	// Добавим элементы на форму.
	Для Каждого ТекНовыеДанные Из ДанныеКДобавлению Цикл
		Элемент = Элементы.Добавить(ТекНовыеДанные.Реквизит.Имя, Тип("ПолеФормы"), ТекНовыеДанные.Группа);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "МатрицаРекомендуемыхУсловий." + ТекНовыеДанные.Реквизит.Имя;
		Элемент.ОтображатьВШапке = Ложь;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЯчейкиМатрицы");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатрицу()
	
	МатрицаРекомендуемыхУсловий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РейтингиЗначимостиКонтрагентов.Ссылка КАК СтепеньДоходности,
	|	РейтингиНадежностиКонтрагентов.Ссылка КАК СтепеньРиска,
	|	РейтингиНадежностиКонтрагентов.РеквизитДопУпорядочивания
	|ПОМЕСТИТЬ ВТ_НадежностьЗначимостьДекартово
	|ИЗ
	|	Справочник.СтепениРиска КАК РейтингиНадежностиКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтепениДоходности КАК РейтингиЗначимостиКонтрагентов
	|		ПО (НЕ РейтингиЗначимостиКонтрагентов.ПометкаУдаления)
	|			И (НЕ РейтингиНадежностиКонтрагентов.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_НадежностьЗначимостьДекартово.СтепеньРиска КАК СтепеньРиска,
	|	ВТ_НадежностьЗначимостьДекартово.СтепеньДоходности,
	|	ЕСТЬNULL(МатрицаРекомендуемыхУсловий.ПроцентАванса, 0) КАК ПроцентАванса,
	|	ЕСТЬNULL(МатрицаРекомендуемыхУсловий.СрокОтсрочки, 0) КАК СрокОтсрочки,
	|	ЕСТЬNULL(МатрицаРекомендуемыхУсловий.ДопустимыйУровеньЗадолженности, 0) КАК ДопустимыйУровеньЗадолженности,
	|	ЕСТЬNULL(МатрицаРекомендуемыхУсловий.ПроцентПросроченнойЗадолженности, 0) КАК ПроцентПросроченнойЗадолженности,
	|	ВТ_НадежностьЗначимостьДекартово.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	|ИЗ
	|	ВТ_НадежностьЗначимостьДекартово КАК ВТ_НадежностьЗначимостьДекартово
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МатрицаРекомендуемыхУсловий КАК МатрицаРекомендуемыхУсловий
	|		ПО (МатрицаРекомендуемыхУсловий.СтепеньРиска = ВТ_НадежностьЗначимостьДекартово.СтепеньРиска)
	|			И (МатрицаРекомендуемыхУсловий.СтепеньДоходности = ВТ_НадежностьЗначимостьДекартово.СтепеньДоходности)
	|			И (МатрицаРекомендуемыхУсловий.РольКонтрагента = &РольКонтрагента)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания
	|ИТОГИ ПО
	|	СтепеньРиска";
	Запрос.УстановитьПараметр("РольКонтрагента", РольКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВалютаУпрУчета = ОбщегоНазначенияПовтИспУХ.ПолучитьВалютуУправленческогоУчета();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = МатрицаРекомендуемыхУсловий.Добавить();
		СтрокаТаблицы.СтепеньРиска 					= Выборка.СтепеньРиска;
		СтрокаТаблицы.НадписьПроцентАванса 			= НСтр("ru = 'Процент аванса'");
		СтрокаТаблицы.НадписьСрокОтсрочки 			= НСтр("ru = 'Срок отсрочки'");
		СтрокаТаблицы.НадписьПроцентЗадолженности 	= НСтр("ru = 'Процент просроченной задолженности'");

				
		Если РольКонтрагента = Перечисления.РолиКонтрагентов.Банки Тогда
			ШаблонТекстаЗадолженность = НСтр("ru = 'Лимит размещения (%1)'");
		Иначе
			ШаблонТекстаЗадолженность = НСтр("ru = 'Лимит задолженности (%1)'");
		КонецЕсли;
		
		СтрокаТаблицы.НадписьЗадолженность = СтрШаблон(ШаблонТекстаЗадолженность, ВалютаУпрУчета);
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Идентификатор = СтрЗаменить(ВыборкаДетальныеЗаписи.СтепеньДоходности.УникальныйИдентификатор(), "-", "");
			СтрокаТаблицы["ПроцентАванса" + Идентификатор] 			= ВыборкаДетальныеЗаписи.ПроцентАванса;
			СтрокаТаблицы["СрокОтсрочки" + Идентификатор] 			= ВыборкаДетальныеЗаписи.СрокОтсрочки;
			СтрокаТаблицы["ПроцентЗадолженности" + Идентификатор] 	= ВыборкаДетальныеЗаписи.ПроцентПросроченнойЗадолженности;
			СтрокаТаблицы["ДопустимыйУровеньЗадолженности" + Идентификатор] = ВыборкаДетальныеЗаписи.ДопустимыйУровеньЗадолженности;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияВМатрице(Знач Идентификатор, Знач ТекущаяСтрока)
	
	Строка = МатрицаРекомендуемыхУсловий.НайтиПоИдентификатору(ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.МатрицаРекомендуемыхУсловий.СоздатьМенеджерЗаписи();
	МЗ.РольКонтрагента 		= РольКонтрагента;
	МЗ.СтепеньРиска 		= Строка.СтепеньРиска;
	МЗ.СтепеньДоходности 	= КэшСтепениДоходности[Идентификатор];
	МЗ.ДопустимыйУровеньЗадолженности 	= Строка["ДопустимыйУровеньЗадолженности" + Идентификатор];
	МЗ.ПроцентАванса 					= Строка["ПроцентАванса" + Идентификатор]; 
	МЗ.ПроцентПросроченнойЗадолженности	= Строка["ПроцентЗадолженности" + Идентификатор];
	МЗ.СрокОтсрочки 					= Строка["СрокОтсрочки" + Идентификатор];
	
	МЗ.Записать();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы 	= Форма.Элементы;
	ЭтоБанки 	= (Форма.РольКонтрагента = ПредопределенноеЗначение("Перечисление.РолиКонтрагентов.Банки"));
	Кэш 		= Форма.КэшСтепениДоходности;
	
	Элементы.МатрицаРекомендуемыхУсловийНадписьПроцентАванса.Видимость 			= Не ЭтоБанки;
	Элементы.МатрицаРекомендуемыхУсловийНадписьСрокОтсрочки.Видимость 			= Не ЭтоБанки;  
	Элементы.МатрицаРекомендуемыхУсловийНадписьПроцентЗадолженности.Видимость 	= Не ЭтоБанки;
 
	Для Каждого КлючИЗначение Из Кэш Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
																	"ПроцентАванса" + КлючИЗначение.Ключ, 
																	"Видимость", 
																	Не ЭтоБанки);
																	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
																	"СрокОтсрочки" + КлючИЗначение.Ключ, 
																	"Видимость", 
																	Не ЭтоБанки);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
																	"ПроцентЗадолженности" + КлючИЗначение.Ключ, 
																	"Видимость", 
																	Не ЭтоБанки);

	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
